
»tests/pos/i3703.scala*
bar/M#*M€*#
bar/M#`<init>`(). €@*<init>€*
	bar/M#[F]	*F€*
bar/S#*S€*#
bar/S#`<init>`(). €@*<init>€*!
bar/S#`<init>`().(x) €*x€*

bar/S#[XS]	*XS€*
	bar/S#[A]	*A€*
bar/S#x. €*x€*
bar/S.
 *S€*
bar/S.apply().*apply€*
bar/S.apply().[X]	*X€*
bar/S.apply().[A]	*A€*
bar/S.apply().(x)*x€* 
bar/S.unapply().*unapply€*
bar/S.unapply().[X]	*X€*
bar/S.unapply().[A]	*A€*
bar/S.unapply().(p)*p€2
 bar/2
 	bar/M#2
	 	bar/M#`<init>`().2

 	bar/M#[F]2
 	bar/S#2
	 	bar/S#`<init>`().2
$ &
bar/S#[XS]2
' (	bar/S#[A]2

 
bar/S#[XS]2
 	bar/S#[A]2
! "bar/S#x.2
	 
bar/S.2
 bar/S.apply().2
 bar/S.apply().[X]2
 bar/S.apply().[A]2
  bar/S.apply().(x)2
" #bar/S.apply().[X]2
$ %bar/S.apply().[A]2
) *bar/S#2
+ ,bar/S.apply().[X]2
. /bar/S.apply().[A]2
4 4bar/S.apply().2
3 4bar/S.2
5 6bar/S.apply().[X]2
8 9bar/S.apply().[A]2
; <bar/S.apply().(x)2
 bar/S.unapply().2!
 bar/S.unapply().[X]2!
 bar/S.unapply().[A]2!
! "bar/S.unapply().(p)2
$ %bar/S#2!
& 'bar/S.unapply().[X]2!
) *bar/S.unapply().[A]2
. /bar/S#2!
0 1bar/S.unapply().[X]2!
3 4bar/S.unapply().[A]2
9 9bar/S.apply().2
8 9bar/S.2
< =bar/S#x.2!
: ;bar/S.unapply().(p)PZ 42F515E5F8FB4CF2F5B295FE7D21670B